app/controllers/codes_controller.rb

SELECT * FROM "codes"
---
  def index
    @codes = Code.all

SELECT * FROM "codes" WHERE ("codes"."id" = 1)
---
  def show
    @code = Code.find(params[:id])

SELECT * FROM "codes" WHERE ("codes"."id" = 5)
---
  def edit
    @code = Code.find(params[:id])

INSERT INTO "codes" ("size", "created_at", "updated_at", "text", "level") VALUES(4, '2010-02-01 21:09:33', '2010-02-01 21:09:33', 'Soleone', 'h')
---
  def create
    @code = Code.new(params[:code])

    respond_to do |format|
      if @code.save

SELECT * FROM "codes" WHERE ("codes"."id" = 5)
---
  def update
    @code = Code.find(params[:id])